sequent1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-28 Thu 06:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>sequent1</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
喪以不執 所執者喪 執喪相比 方死方生
</div>
<div id="content">
<h1 class="title">sequent1</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga7a3b9a"><span class="done todo">todo</span> </a></li>
<li><a href="#org4dba259">helper</a>
<ul>
<li><a href="#org4992828">pattern match</a></li>
<li><a href="#org2c19978">cat &amp; orz</a></li>
<li><a href="#orga75d756">little-test</a></li>
<li><a href="#org887f69c">list</a></li>
<li><a href="#org466056d">string</a></li>
</ul>
</li>
<li><a href="#org720ae05"><span class="todo note">note</span> </a>
<ul>
<li><a href="#orgf6fdd8a">as prototype</a></li>
<li><a href="#org4fc26b8">sequent</a></li>
<li><a href="#orgbaafa99">form</a>
<ul>
<li><a href="#org8f1555e">form1</a></li>
<li><a href="#orgbb92374">form2</a></li>
<li><a href="#org591c97f">form3</a></li>
</ul>
</li>
<li><a href="#orgb69e583">data</a></li>
<li><a href="#orgcd398af">arity</a></li>
<li><a href="#orgd1d12f2">env</a></li>
<li><a href="#org43f1133">meaning</a></li>
<li><a href="#orgcb3fe43">top</a>
<ul>
<li><a href="#org3f02f3e">top1</a></li>
<li><a href="#org51d9149">top2</a></li>
</ul>
</li>
<li><a href="#org1849ce0">report</a></li>
</ul>
</li>
<li><a href="#org17c0943">pass</a>
<ul>
<li><a href="#org58584ed">pass1</a>
<ul>
<li><a href="#orgcc9eb0c">pass1/arrow</a></li>
<li><a href="#org419b726">pass1/cedent</a></li>
<li><a href="#org75e5b15">predicates</a></li>
<li><a href="#org4b8e6e6">pass1</a></li>
<li><a href="#org913464f">pass1/var</a></li>
<li><a href="#org88c294c"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#orgd8b173a">pass2</a>
<ul>
<li><a href="#orgbdede7a">pass2/arrow</a></li>
<li><a href="#orge1de7">pass2/cedent</a></li>
<li><a href="#org1f2fb37">pass2/lambda</a></li>
<li><a href="#org842d206">pass2</a></li>
<li><a href="#org9119521">pass2/var</a></li>
<li><a href="#orgd827d92">pass2/bind</a></li>
<li><a href="#orgef202e4"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#org428ac4c">pass3</a>
<ul>
<li><a href="#orgc4e93bb">pass3/get-arrow</a></li>
<li><a href="#orgf277e98">pass3/arrow</a></li>
<li><a href="#org9b216b">pass3/cedent</a></li>
<li><a href="#orgcf6260d">pass3/lambda</a></li>
<li><a href="#org29df1e">pass3</a></li>
<li><a href="#orgfbaeddf">pass3/var</a></li>
<li><a href="#org58a0070">id-&gt;[symbol|ls]</a></li>
<li><a href="#org9ca6700"><span class="todo _gt__lt__gt__lt__gt__lt_">&gt;&lt;&gt;&lt;&gt;&lt;</span> bs/[find|walk|deep]</a></li>
<li><a href="#org2323c4a">pass3/name</a></li>
<li><a href="#org32bfa71">pass3/name/cons</a></li>
<li><a href="#org497bdad">pass3/name/trunk</a></li>
<li><a href="#orga71507">pass3/name/proj</a></li>
<li><a href="#orgaa8a51d">pass3/bind</a></li>
<li><a href="#org666c374">id/commit!</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga8ccf91">copy-arrow</a>
<ul>
<li><a href="#org1a7f60b"><span class="todo note">note</span> copy</a></li>
<li><a href="#org899a3b0">copy-arrow</a></li>
<li><a href="#org98ca98e">copy/arrow</a></li>
<li><a href="#orga495979">copy/cedent</a></li>
<li><a href="#orgb275f1d">copy/lambda</a></li>
<li><a href="#org2473edf">copy/arrow-list</a></li>
<li><a href="#orgdf906b8">copy</a></li>
<li><a href="#orga5c6b24">copy/var</a></li>
<li><a href="#org753ed69">copy/ls</a></li>
<li><a href="#org27d791c">copy/cons</a></li>
<li><a href="#org426a0ce">copy/trunk</a></li>
<li><a href="#org1c12b16">copy/proj</a></li>
</ul>
</li>
<li><a href="#org461d9cd">compute-arrow</a>
<ul>
<li><a href="#orgf9d28b9">compute-arrow</a></li>
<li><a href="#orge829e12">bs/commit!</a></li>
<li><a href="#orgbf00343">compute/cedent</a></li>
<li><a href="#orgb3834be">compute</a></li>
</ul>
</li>
<li><a href="#orgdebb49f"><span class="todo _gt__lt_">&gt;&lt;</span> unify</a>
<ul>
<li><a href="#orga4d623b"><span class="todo _gt__lt_">&gt;&lt;</span> unify</a></li>
<li><a href="#org809f8bd"><span class="todo _gt__lt_">&gt;&lt;</span> bs/extend</a></li>
</ul>
</li>
<li><a href="#orgd109c17"><span class="todo _gt__lt_">&gt;&lt;</span> eva</a></li>
<li><a href="#org54de80e"><span class="todo _gt__lt_">&gt;&lt;</span> check</a></li>
<li><a href="#orge87fc27"><span class="todo _gt__lt_">&gt;&lt;</span> type-compute</a></li>
<li><a href="#org487fcea"><span class="todo _gt__lt_">&gt;&lt;</span> sequent</a></li>
<li><a href="#orge94bf23"><span class="done test">test</span> </a>
<ul>
<li><a href="#org1e9f619">natural</a></li>
<li><a href="#orge94192b">list</a></li>
<li><a href="#org261d930">vector</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><p>a prototype interpreter for a functional language</p><p>which uses sequent calculus as dependent type system</p></li>

<li><p>XIE Yuheng created</p></li></ul>

<div id="outline-container-orga7a3b9a" class="outline-2">
<h2 id="orga7a3b9a"><span class="done todo">todo</span> </h2>
<div class="outline-text-2" id="text-orga7a3b9a">
<ul class="org-ul">
<li><p>data/print</p><p>different var should be print differently</p></li>

<li><p>check-type</p><p>infer-arity</p><p>check-cover</p><p>check-end</p></li></ul>
</div>
</div>

<div id="outline-container-org4dba259" class="outline-2">
<h2 id="org4dba259">helper</h2>
<div class="outline-text-2" id="text-org4dba259">
</div><div id="outline-container-org4992828" class="outline-3">
<h3 id="org4992828">pattern match</h3>
<div class="outline-text-3" id="text-org4992828">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #FF8888;">;; </span><span style="color: #FF8888;">module system of guile</span>
<span style="color: #FF8888;">;; </span><span style="color: #FF8888;">using http://synthcode.com/scheme/match.scm</span>
(use-modules (ice-9 match))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c19978" class="outline-3">
<h3 id="org2c19978">cat &amp; orz</h3>
<div class="outline-text-3" id="text-org2c19978">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define-syntax</span> <span style="color: #fd971f;">cat</span>
  (<span style="color: #f92672; font-weight: bold;">syntax-rules</span> ()
    [(cat (str . args))
     <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(format str . args)</span>
     <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">guile</span>
     (format #t str . args)]
    [(cat (str . args) (str2 . args2) ...)
     (string-append
      (cat (str . args))
      (cat (str2 . args2) ...))]))

(<span style="color: #f92672; font-weight: bold;">define-syntax</span> <span style="color: #fd971f;">orz</span>
  (<span style="color: #f92672; font-weight: bold;">syntax-rules</span> ()
    [(<span style="color: #f92672; font-weight: bold;">orz</span> . body)
     (<span style="color: #f92672; font-weight: bold;">error</span> (cat . body))]))

(<span style="color: #f92672; font-weight: bold;">define-syntax</span> <span style="color: #fd971f;">note</span>
  (<span style="color: #f92672; font-weight: bold;">syntax-rules</span> ()
    [(<span style="color: #f92672; font-weight: bold;">note</span> . body)
     '()]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga75d756" class="outline-3">
<h3 id="orga75d756">little-test</h3>
<div class="outline-text-3" id="text-orga75d756">
<div class="org-src-container">

<pre class="src src-scheme">(use-modules (ice-9 pretty-print))

(<span style="color: #f92672; font-weight: bold;">define-syntax</span> <span style="color: #fd971f;">test</span>
  (<span style="color: #f92672; font-weight: bold;">syntax-rules</span> ()
    [(test b1 b2)
     (<span style="color: #f92672; font-weight: bold;">if</span> (equal? b1 b2)
       #t
       (<span style="color: #f92672; font-weight: bold;">let</span> ()
         (cat (<span style="color: #e6db74;">"\n"</span>))
         (cat (<span style="color: #e6db74;">"&lt;test-fail-report-begin&gt;\n"</span>))
         (cat (<span style="color: #e6db74;">"&lt;actual-form&gt; :\n"</span>))
         (pretty-print (<span style="color: #f92672; font-weight: bold;">quote</span> b1))
         (cat (<span style="color: #e6db74;">"&lt;actual-value&gt; :\n"</span>))
         (pretty-print b1)
         (cat (<span style="color: #e6db74;">"&lt;expect-form&gt; :\n"</span>))
         (pretty-print (<span style="color: #f92672; font-weight: bold;">quote</span> b2))
         (cat (<span style="color: #e6db74;">"&lt;expect-value&gt; :\n"</span>))
         (pretty-print b2)
         (<span style="color: #f92672; font-weight: bold;">orz</span> (<span style="color: #e6db74;">"&lt;test-fail-report-end&gt;\n"</span>))))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org887f69c" class="outline-3">
<h3 id="org887f69c">list</h3>
<div class="outline-text-3" id="text-org887f69c">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">left-of</span> s l)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">sexp, list -&gt; list</span>
  (<span style="color: #f92672; font-weight: bold;">cond</span> [(equal? s (car l)) '()]
        [else (cons (car l) (left-of s (cdr l)))]))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">right-of</span> s l)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">sexp, list -&gt; list</span>
  (<span style="color: #f92672; font-weight: bold;">cond</span> [(equal? s (car l)) (cdr l)]
        [else (right-of s (cdr l))]))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">sublist</span> l start end)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">list, index, index -&gt; list</span>
  (<span style="color: #f92672; font-weight: bold;">cond</span> [(<span style="color: #f92672; font-weight: bold;">and</span> (eq? 0 start) (&lt;= end 0)) '()]
        [(<span style="color: #f92672; font-weight: bold;">and</span> (not (eq? 0 start)))
         (sublist (cdr l) (- start 1) (- end 1))]
        [(<span style="color: #f92672; font-weight: bold;">and</span> (eq? 0 start) (not (eq? 0 end)))
         (cons (car l) (sublist (cdr l) 0 (- end 1)))]))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">genlist</span> len)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">length -&gt; list</span>
  (<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">recur</span> len counter)
    (<span style="color: #f92672; font-weight: bold;">cond</span> [(eq? len counter) '()]
          [else (cons counter
                      (recur len (+ 1 counter)))]))
  (recur len 0))
</pre>
</div>
</div>
</div>

<div id="outline-container-org466056d" class="outline-3">
<h3 id="org466056d">string</h3>
<div class="outline-text-3" id="text-org466056d">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">find-char</span> c s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">char, string -&gt; curser or #f</span>
  (find-char/curser c s 0))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">find-char/curser</span> c s curser)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">char, string, curser -&gt; curser or #f</span>
  (<span style="color: #f92672; font-weight: bold;">if</span> (&gt;= curser (string-length s))
    #f
    (<span style="color: #f92672; font-weight: bold;">let</span> ([c0 (substring s curser (+ 1 curser))])
      (<span style="color: #f92672; font-weight: bold;">if</span> (equal? c c0)
        curser
        (find-char/curser c s (+ 1 curser))))))
</pre>
</div>
</div>
</div>
</div>
