sequent1.org
*** as prototype

    - lazy-eval
      call-by-name

*** sequent

    - sequent is arrow
      which is the core data type of the language

*** form

***** form1

      - form1 =
        - form1/var =
          :var
          :var^n
        - form1/name =
          name
        - form1/arrow =
          (form1 ... -> form1 ...)
        - form1/lambda =
          (lambda form1/arrow
            form1/arrow
            ...)
        - form1/im-bind =
          (form1/var ... : form1 ...)
        - form1/ex-bind =
          (form1/var ... @ form1 ...)

***** form2

      - form1 -pass1-> form2
        level of var is handled here

      - form2 =
        ('form2/var    (symbol level))
        ('form2/name   symbol)
        ('form2/arrow  ((form2 ...) (form2 ...)))
        ('form2/lambda (form2/arrow (form2/arrow ...)))
        ('form2/bind   ((form2/var ...) (form2 ...) leave?))
      - level = natural-number
      - leave? = 'leave | 'not-leave

***** form3

      - form2 -pass2-> form3
        id of var is handled here

      - form3 =
        ('form3/var    (id level))
        ('form3/name   symbol)
        ('form3/arrow  ((form3 ...) (form3 ...)))
        ('form3/lambda (form3/arrow (form3/arrow ...)))
        ('form3/bind   ((form3/var ...) (form3 ...) leave?))
      - id = #(symbol ls)

*** data

    - form3 -pass3-> data
      cons trunk proj are created here
      arity is calculated here
    - pass3 will use env passing
      note that
      when env passing is used
      those functions would not be separately testable
    - no unification here
      bs is not used here
      bind just effect on the id of var
    - ns is searched
      but no effect on ns
    - how should I express such in type ?

    - data =
      ('var    (id level))
      ('cons   (name (data ...)))
      ('arrow  ((data ...) (data ...)))
      ('lambda (arrow (arrow ...)))
      ('trunk  (arrow (arrow ...) (data ...)))
      ('proj   (arrow (arrow ...) (data ...) index))

*** arity

    - there can be
      arity = (number number)
      in lambda & trunk
      but do not use separate arity for simplicity
      arity is calculated from arrow repeatly

*** env

    - env = (ds bs ns)
    - ds = (data ...)
    - bs = ((id . ls) ...)
      - ls = ((level . data) ...)
    - ns = ((name . meaning) ...)

*** meaning

    - meaning =
      ('cons/type (arrow name (name ...)))
      ('cons/data (arrow name name))
      ('lambda    (arrow (arrow ...)))

*** top

***** top1

      - top1 =
        ('dt ((form1/name form1/arrow) ((form1/name form1/arrow) ...)))
        ('df ((form1/name form1/arrow) (form1/arrow ...)))
        ('ap form1/arrow)

***** top2

      - top2 =
        ('top2/dt ((form2/name form2/arrow) ((form2/name form2/arrow) ...)))
        ('top2/df ((form2/name form2/arrow) (form2/arrow ...)))
        ('top2/ap form2/arrow)

*** report

    - report =
      ('fail (info ...))
      ('success env)
    - info = <free>

* pass

*** pass1

***** pass1/arrow

      #+begin_src scheme
      (define (pass1/arrow default-level s)
        ;; default-level, form1/arrow -> form2/arrow
        (list (pass1/cedent default-level (left-of '-> s))
              (pass1/cedent default-level (right-of '-> s))))
      #+end_src

***** pass1/cedent

      #+begin_src scheme
      (define (pass1/cedent default-level s)
        ;; default-level, (form1 ...) -> (form2 ...)
        (match s
          [() '()]
          [(h . r) (cons (pass1 default-level h)
                         (pass1/cedent default-level r))]))
      #+end_src

***** predicates

      #+begin_src scheme
      (define (form1/var? v)
        (and (symbol? v)
             (equal? ":" (substring (symbol->string v) 0 1))))

      (define (form1/name? v)
        (and (symbol? v)
             (not (eq? ":" (substring (symbol->string v) 0 1)))))

      (define (form1/arrow? v)
        (and (list? v)
             (member '-> v)))

      (define (form1/lambda? v)
        (and (list? v)
             (eq? (car v) 'lambda)))

      (define (form1/im-bind? v)
        (and (list? v)
             (member ': v)))

      (define (form1/ex-bind? v)
        (and (list? v)
             (member '@ v)))
      #+end_src

