sequent1.html

<div id="outline-container-org720ae05" class="outline-2">
<h2 id="org720ae05"><span class="todo note">note</span> </h2>
<div class="outline-text-2" id="text-org720ae05">
</div><div id="outline-container-orgf6fdd8a" class="outline-3">
<h3 id="orgf6fdd8a">as prototype</h3>
<div class="outline-text-3" id="text-orgf6fdd8a">
<ul class="org-ul">
<li><p>lazy-eval</p><p>call-by-name</p></li></ul>
</div>
</div>

<div id="outline-container-org4fc26b8" class="outline-3">
<h3 id="org4fc26b8">sequent</h3>
<div class="outline-text-3" id="text-org4fc26b8">
<ul class="org-ul">
<li><p>sequent is arrow</p><p>which is the core data type of the language</p></li></ul>
</div>
</div>

<div id="outline-container-orgbaafa99" class="outline-3">
<h3 id="orgbaafa99">form</h3>
<div class="outline-text-3" id="text-orgbaafa99">
</div><div id="outline-container-org8f1555e" class="outline-4">
<h4 id="org8f1555e">form1</h4>
<div class="outline-text-4" id="text-org8f1555e">
<ul class="org-ul">
<li><p>form1 =</p><p><ul class="org-ul"></p><p><li><p>form1/var =</p><p>:var</p><p>:var<sup>n</sup></p></li></p><p><li><p>form1/name =</p><p>name</p></li></p><p><li><p>form1/arrow =</p><p>(form1 &#x2026; -&gt; form1 &#x2026;)</p></li></p><p><li><p>form1/lambda =</p><p>(lambda form1/arrow</p><p>  form1/arrow</p><p>  &#x2026;)</p></li></p><p><li><p>form1/im-bind =</p><p>(form1/var &#x2026; : form1 &#x2026;)</p></li></p><p><li><p>form1/ex-bind =</p><p>(form1/var &#x2026; @ form1 &#x2026;)</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-orgbb92374" class="outline-4">
<h4 id="orgbb92374">form2</h4>
<div class="outline-text-4" id="text-orgbb92374">
<ul class="org-ul">
<li><p>form1 -pass1-&gt; form2</p><p>level of var is handled here</p></li>

<li><p>form2 =</p><p>('form2/var    (symbol level))</p><p>('form2/name   symbol)</p><p>('form2/arrow  ((form2 &#x2026;) (form2 &#x2026;)))</p><p>('form2/lambda (form2/arrow (form2/arrow &#x2026;)))</p><p>('form2/bind   ((form2/var &#x2026;) (form2 &#x2026;) leave?))</p></li>
<li><p>level = natural-number</p></li>
<li><p>leave? = 'leave | 'not-leave</p></li></ul>
</div>
</div>

<div id="outline-container-org591c97f" class="outline-4">
<h4 id="org591c97f">form3</h4>
<div class="outline-text-4" id="text-org591c97f">
<ul class="org-ul">
<li><p>form2 -pass2-&gt; form3</p><p>id of var is handled here</p></li>

<li><p>form3 =</p><p>('form3/var    (id level))</p><p>('form3/name   symbol)</p><p>('form3/arrow  ((form3 &#x2026;) (form3 &#x2026;)))</p><p>('form3/lambda (form3/arrow (form3/arrow &#x2026;)))</p><p>('form3/bind   ((form3/var &#x2026;) (form3 &#x2026;) leave?))</p></li>
<li><p>id = #(symbol ls)</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-orgb69e583" class="outline-3">
<h3 id="orgb69e583">data</h3>
<div class="outline-text-3" id="text-orgb69e583">
<ul class="org-ul">
<li><p>form3 -pass3-&gt; data</p><p>cons trunk proj are created here</p><p>arity is calculated here</p></li>
<li><p>pass3 will use env passing</p><p>note that</p><p>when env passing is used</p><p>those functions would not be separately testable</p></li>
<li><p>no unification here</p><p>bs is not used here</p><p>bind just effect on the id of var</p></li>
<li><p>ns is searched</p><p>but no effect on ns</p></li>
<li><p>how should I express such in type ?</p></li>

<li><p>data =</p><p>('var    (id level))</p><p>('cons   (name (data &#x2026;)))</p><p>('arrow  ((data &#x2026;) (data &#x2026;)))</p><p>('lambda (arrow (arrow &#x2026;)))</p><p>('trunk  (arrow (arrow &#x2026;) (data &#x2026;)))</p><p>('proj   (arrow (arrow &#x2026;) (data &#x2026;) index))</p></li></ul>
</div>
</div>

<div id="outline-container-orgcd398af" class="outline-3">
<h3 id="orgcd398af">arity</h3>
<div class="outline-text-3" id="text-orgcd398af">
<ul class="org-ul">
<li><p>there can be</p><p>arity = (number number)</p><p>in lambda &amp; trunk</p><p>but do not use separate arity for simplicity</p><p>arity is calculated from arrow repeatly</p></li></ul>
</div>
</div>

<div id="outline-container-orgd1d12f2" class="outline-3">
<h3 id="orgd1d12f2">env</h3>
<div class="outline-text-3" id="text-orgd1d12f2">
<ul class="org-ul">
<li><p>env = (ds bs ns)</p></li>
<li><p>ds = (data &#x2026;)</p></li>
<li><p>bs = ((id . ls) &#x2026;)</p><p><ul class="org-ul"></p><p><li><p>ls = ((level . data) &#x2026;)</p></li></ul></p></li>
<li><p>ns = ((name . meaning) &#x2026;)</p></li></ul>
</div>
</div>

<div id="outline-container-org43f1133" class="outline-3">
<h3 id="org43f1133">meaning</h3>
<div class="outline-text-3" id="text-org43f1133">
<ul class="org-ul">
<li><p>meaning =</p><p>('cons/type (arrow name (name &#x2026;)))</p><p>('cons/data (arrow name name))</p><p>('lambda    (arrow (arrow &#x2026;)))</p></li></ul>
</div>
</div>

<div id="outline-container-orgcb3fe43" class="outline-3">
<h3 id="orgcb3fe43">top</h3>
<div class="outline-text-3" id="text-orgcb3fe43">
</div><div id="outline-container-org3f02f3e" class="outline-4">
<h4 id="org3f02f3e">top1</h4>
<div class="outline-text-4" id="text-org3f02f3e">
<ul class="org-ul">
<li><p>top1 =</p><p>('dt ((form1/name form1/arrow) ((form1/name form1/arrow) &#x2026;)))</p><p>('df ((form1/name form1/arrow) (form1/arrow &#x2026;)))</p><p>('ap form1/arrow)</p></li></ul>
</div>
</div>

<div id="outline-container-org51d9149" class="outline-4">
<h4 id="org51d9149">top2</h4>
<div class="outline-text-4" id="text-org51d9149">
<ul class="org-ul">
<li><p>top2 =</p><p>('top2/dt ((form2/name form2/arrow) ((form2/name form2/arrow) &#x2026;)))</p><p>('top2/df ((form2/name form2/arrow) (form2/arrow &#x2026;)))</p><p>('top2/ap form2/arrow)</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org1849ce0" class="outline-3">
<h3 id="org1849ce0">report</h3>
<div class="outline-text-3" id="text-org1849ce0">
<ul class="org-ul">
<li><p>report =</p><p>('fail (info &#x2026;))</p><p>('success env)</p></li>
<li><p>info = &lt;free&gt;</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org17c0943" class="outline-2">
<h2 id="org17c0943">pass</h2>
<div class="outline-text-2" id="text-org17c0943">
</div><div id="outline-container-org58584ed" class="outline-3">
<h3 id="org58584ed">pass1</h3>
<div class="outline-text-3" id="text-org58584ed">
</div><div id="outline-container-orgcc9eb0c" class="outline-4">
<h4 id="orgcc9eb0c">pass1/arrow</h4>
<div class="outline-text-4" id="text-orgcc9eb0c">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass1/arrow</span> default-level s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">default-level, form1/arrow -&gt; form2/arrow</span>
  (list (pass1/cedent default-level (left-of '<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> s))
        (pass1/cedent default-level (right-of '<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> s))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org419b726" class="outline-4">
<h4 id="org419b726">pass1/cedent</h4>
<div class="outline-text-4" id="text-org419b726">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass1/cedent</span> default-level s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">default-level, (form1 ...) -&gt; (form2 ...)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> s
    [() '()]
    [(h . r) (cons (pass1 default-level h)
                   (pass1/cedent default-level r))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org75e5b15" class="outline-4">
<h4 id="org75e5b15">predicates</h4>
<div class="outline-text-4" id="text-org75e5b15">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/var?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (symbol? v)
       (equal? <span style="color: #e6db74;">":"</span> (substring (symbol-&gt;string v) 0 1))))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/name?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (symbol? v)
       (not (eq? <span style="color: #e6db74;">":"</span> (substring (symbol-&gt;string v) 0 1)))))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/arrow?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (list? v)
       (member '<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> v)))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/lambda?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (list? v)
       (eq? (car v) 'lambda)))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/im-bind?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (list? v)
       (member ': v)))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/ex-bind?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (list? v)
       (member '@ v)))
</pre>
</div>
</div>
</div>
