sequent1.org
***** pass1

      #+begin_src scheme
      (define (pass1 default-level v)
        ;; default-level, form1 -> form2
        (cond [(form1/var? v)
               (list 'form2/var
                     (pass1/var default-level v))]
              [(form1/name? v)
               (list 'form2/name
                     v)]
              [(form1/arrow? v)
               (list 'form2/arrow
                     (pass1/arrow default-level v))]
              [(form1/lambda? v)
               (list 'form2/lambda
                     (list (pass1/arrow default-level (cadr v))
                           (map (lambda (x) (pass1/arrow default-level x))
                             (cddr v))))]
              [(form1/im-bind? v)
               (list 'form2/bind
                     (list (pass1/cedent 1 (left-of ': v))
                           (pass1/cedent 0 (right-of ': v))
                           'leave))]
              [(form1/ex-bind? v)
               (list 'form2/bind
                     (list (pass1/cedent 1 (left-of '@ v))
                           (pass1/cedent 0 (right-of '@ v))
                           'not-leave))]
              [else
               (orz ("pass1 can not handle sexp-form:~a" v))]))
      #+end_src

***** pass1/var

      #+begin_src scheme
      (define (pass1/var default-level v)
        ;; default-level, symbol -> form2/var
        (let* ([str (symbol->string v)]
               [cursor (find-char "^" str)])
          (if cursor
            (list (string->symbol (substring str 0 cursor))
                  (string->number (substring str (+ 1 cursor))))
            (list v default-level))))
      #+end_src

***** test

      #+begin_src scheme
      (test
       (map (lambda (x) (pass1/arrow 0 x))
         '((natural natural -> natural)
           (natural natural -> (natural natural -> natural) natural)
           (:m zero -> :m)
           (:m :n succ -> :m :n recur succ)
           (:m :n succ -> :m :n (lambda (natural natural -> natural)
                                  (:m :n succ -> :m :n recur succ)
                                  (:m :n succ -> :m :n recur succ)))
           ((:t : type) :t -> type)
           ((:t @ type) :t -> type)
           ((:t^2 : type) :t -> type)
           ((:t1 :t2^2 :t3^0 : j k) :t -> type)
           ((:t^2 @ type) :t -> type)))
       '((((form2/name natural) (form2/name natural))
          ((form2/name natural)))
         (((form2/name natural) (form2/name natural))
          ((form2/arrow (((form2/name natural) (form2/name natural)) ((form2/name natural)))) (form2/name natural)))
         (((form2/var (:m 0)) (form2/name zero))
          ((form2/var (:m 0))))
         (((form2/var (:m 0)) (form2/var (:n 0)) (form2/name succ))
          ((form2/var (:m 0)) (form2/var (:n 0)) (form2/name recur) (form2/name succ)))
         (((form2/var (:m 0)) (form2/var (:n 0)) (form2/name succ))
          ((form2/var (:m 0)) (form2/var (:n 0)) (form2/lambda ((((form2/name natural) (form2/name natural)) ((form2/name natural))) ((((form2/var (:m 0)) (form2/var (:n 0)) (form2/name succ)) ((form2/var (:m 0)) (form2/var (:n 0)) (form2/name recur) (form2/name succ))) (((form2/var (:m 0)) (form2/var (:n 0)) (form2/name succ)) ((form2/var (:m 0)) (form2/var (:n 0)) (form2/name recur) (form2/name succ))))))))
         (((form2/bind (((form2/var (:t 1))) ((form2/name type)) leave)) (form2/var (:t 0)))
          ((form2/name type)))
         (((form2/bind (((form2/var (:t 1))) ((form2/name type)) not-leave)) (form2/var (:t 0)))
          ((form2/name type)))
         (((form2/bind (((form2/var (:t 2))) ((form2/name type)) leave)) (form2/var (:t 0)))
          ((form2/name type)))
         (((form2/bind (((form2/var (:t1 1)) (form2/var (:t2 2)) (form2/var (:t3 0))) ((form2/name j) (form2/name k)) leave)) (form2/var (:t 0)))
          ((form2/name type)))
         (((form2/bind (((form2/var (:t 2))) ((form2/name type)) not-leave)) (form2/var (:t 0)))
          ((form2/name type)))))
      #+end_src

*** pass2

***** pass2/arrow

      #+begin_src scheme
      (define (pass2/arrow a s)
        ;; form2/arrow, scope -> (form3/arrow scope)
        (match a
          [(ac sc)
           (match (pass2/cedent ac s)
             [(3ac s1)
              (match (pass2/cedent sc s1)
                [(3sc s2)
                 (list (list 3ac 3sc) s2)])])]))
      #+end_src

***** pass2/cedent

      #+begin_src scheme
      (define (pass2/cedent c s)
        ;; (form2 ...), scope -> ((form3 ...) scope)
        (match c
          [() (list '() s)]
          [(h . r)
           (match (pass2 h s)
             [(3f s1)
              (match (pass2/cedent r s1)
                [(3c s2)
                 (list (cons 3f 3c) s2)])])]))
      #+end_src

***** pass2/lambda

      #+begin_src scheme
      (define (pass2/lambda l s)
        ;; form2/lambda, scope -> (form3/lambda scope)
        (match l
          [(a al)
           (list (list (pass2/arrow a s)
                       (map (lambda (x) (pass2/arrow x s))
                         al))
                 s)]))
      #+end_src

