sequent1.html

<div id="outline-container-org4b8e6e6" class="outline-4">
<h4 id="org4b8e6e6">pass1</h4>
<div class="outline-text-4" id="text-org4b8e6e6">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass1</span> default-level v)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">default-level, form1 -&gt; form2</span>
  (<span style="color: #f92672; font-weight: bold;">cond</span> [(form1/var? v)
         (list 'form2/var
               (pass1/var default-level v))]
        [(form1/name? v)
         (list 'form2/name
               v)]
        [(form1/arrow? v)
         (list 'form2/arrow
               (pass1/arrow default-level v))]
        [(form1/lambda? v)
         (list 'form2/lambda
               (list (pass1/arrow default-level (cadr v))
                     (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (pass1/arrow default-level x))
                       (cddr v))))]
        [(form1/im-bind? v)
         (list 'form2/bind
               (list (pass1/cedent 1 (left-of ': v))
                     (pass1/cedent 0 (right-of ': v))
                     'leave))]
        [(form1/ex-bind? v)
         (list 'form2/bind
               (list (pass1/cedent 1 (left-of '@ v))
                     (pass1/cedent 0 (right-of '@ v))
                     'not-leave))]
        [else
         (<span style="color: #f92672; font-weight: bold;">orz</span> (<span style="color: #e6db74;">"pass1 can not handle sexp-form:~a"</span> v))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org913464f" class="outline-4">
<h4 id="org913464f">pass1/var</h4>
<div class="outline-text-4" id="text-org913464f">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass1/var</span> default-level v)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">default-level, symbol -&gt; form2/var</span>
  (<span style="color: #f92672; font-weight: bold;">let*</span> ([str (symbol-&gt;string v)]
         [cursor (find-char <span style="color: #e6db74;">"^"</span> str)])
    (<span style="color: #f92672; font-weight: bold;">if</span> cursor
      (list (string-&gt;symbol (substring str 0 cursor))
            (string-&gt;number (substring str (+ 1 cursor))))
      (list v default-level))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org88c294c" class="outline-4">
<h4 id="org88c294c"><span class="done test">test</span> </h4>
<div class="outline-text-4" id="text-org88c294c">
<div class="org-src-container">

<pre class="src src-scheme">(test
 (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (pass1/arrow 0 x))
   '((natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
     (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural) natural)
     (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span>)
     (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)
     (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
                            (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)
                            (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)))
     ((<span style="color: #a6e22e;">:t</span> : type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
     ((<span style="color: #a6e22e;">:t</span> @ type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
     ((<span style="color: #a6e22e;">:t^2</span> : type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
     ((<span style="color: #a6e22e;">:t1</span> <span style="color: #a6e22e;">:t2^2</span> <span style="color: #a6e22e;">:t3^0</span> : j k) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
     ((<span style="color: #a6e22e;">:t^2</span> @ type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)))
 '((((form2/name natural) (form2/name natural))
    ((form2/name natural)))
   (((form2/name natural) (form2/name natural))
    ((form2/arrow (((form2/name natural) (form2/name natural)) ((form2/name natural)))) (form2/name natural)))
   (((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/name zero))
    ((form2/var (<span style="color: #a6e22e;">:m</span> 0))))
   (((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name succ))
    ((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name recur) (form2/name succ)))
   (((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name succ))
    ((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/lambda ((((form2/name natural) (form2/name natural)) ((form2/name natural))) ((((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name succ)) ((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name recur) (form2/name succ))) (((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name succ)) ((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name recur) (form2/name succ))))))))
   (((form2/bind (((form2/var (<span style="color: #a6e22e;">:t</span> 1))) ((form2/name type)) leave)) (form2/var (<span style="color: #a6e22e;">:t</span> 0)))
    ((form2/name type)))
   (((form2/bind (((form2/var (<span style="color: #a6e22e;">:t</span> 1))) ((form2/name type)) not-leave)) (form2/var (<span style="color: #a6e22e;">:t</span> 0)))
    ((form2/name type)))
   (((form2/bind (((form2/var (<span style="color: #a6e22e;">:t</span> 2))) ((form2/name type)) leave)) (form2/var (<span style="color: #a6e22e;">:t</span> 0)))
    ((form2/name type)))
   (((form2/bind (((form2/var (<span style="color: #a6e22e;">:t1</span> 1)) (form2/var (<span style="color: #a6e22e;">:t2</span> 2)) (form2/var (<span style="color: #a6e22e;">:t3</span> 0))) ((form2/name j) (form2/name k)) leave)) (form2/var (<span style="color: #a6e22e;">:t</span> 0)))
    ((form2/name type)))
   (((form2/bind (((form2/var (<span style="color: #a6e22e;">:t</span> 2))) ((form2/name type)) not-leave)) (form2/var (<span style="color: #a6e22e;">:t</span> 0)))
    ((form2/name type)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd8b173a" class="outline-3">
<h3 id="orgd8b173a">pass2</h3>
<div class="outline-text-3" id="text-orgd8b173a">
</div><div id="outline-container-orgbdede7a" class="outline-4">
<h4 id="orgbdede7a">pass2/arrow</h4>
<div class="outline-text-4" id="text-orgbdede7a">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2/arrow</span> a s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form2/arrow, scope -&gt; (form3/arrow scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> a
    [(ac sc)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/cedent ac s)
       [(3ac s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/cedent sc s1)
          [(3sc s2)
           (list (list 3ac 3sc) s2)])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1de7" class="outline-4">
<h4 id="orge1de7">pass2/cedent</h4>
<div class="outline-text-4" id="text-orge1de7">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2/cedent</span> c s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(form2 ...), scope -&gt; ((form3 ...) scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> c
    [() (list '() s)]
    [(h . r)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2 h s)
       [(3f s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/cedent r s1)
          [(3c s2)
           (list (cons 3f 3c) s2)])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f2fb37" class="outline-4">
<h4 id="org1f2fb37">pass2/lambda</h4>
<div class="outline-text-4" id="text-org1f2fb37">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2/lambda</span> l s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form2/lambda, scope -&gt; (form3/lambda scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> l
    [(a al)
     (list (list (pass2/arrow a s)
                 (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (pass2/arrow x s))
                   al))
           s)]))
</pre>
</div>
</div>
</div>
