sequent1.html

<div id="outline-container-org842d206" class="outline-4">
<h4 id="org842d206">pass2</h4>
<div class="outline-text-4" id="text-org842d206">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2</span> f s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form2, scope -&gt; (form2 scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> f
    [('form2/var v)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/var v s)
       [(v1 s1)
        (list (list 'form3/var v1) s1)])]
    [('form2/name n)
     (list (list 'form3/name n) s)]
    [('form2/arrow a)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/arrow a s)
       [(a1 s1)
        (list (list 'form3/arrow a1) s1)])]
    [('form2/lambda l)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/lambda l s)
       [(l1 s1)
        (list (list 'form3/lambda l1) s1)])]
    [('form2/bind b)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/bind b s)
       [(b1 s1)
        (list (list 'form3/bind b1) s1)])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9119521" class="outline-4">
<h4 id="org9119521">pass2/var</h4>
<div class="outline-text-4" id="text-org9119521">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2/var</span> v s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form2/var, scope -&gt; (form3/var scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> v
    [(symbol level)
     (<span style="color: #f92672; font-weight: bold;">let</span> ([found (assq symbol s)])
       (<span style="color: #f92672; font-weight: bold;">if</span> found
         (<span style="color: #f92672; font-weight: bold;">let</span> ([old (cdr found)])
           (list (list old level)
                 s))
         (<span style="color: #f92672; font-weight: bold;">let</span> ([new (vector symbol '())])
           (list (list new level)
                 (cons (cons symbol new) s)))))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd827d92" class="outline-4">
<h4 id="orgd827d92">pass2/bind</h4>
<div class="outline-text-4" id="text-orgd827d92">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2/bind</span> b s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form2/bind, scope -&gt; (form3/bind scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> b
    [(vs c leave?)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/cedent vs s)
       [(3vs s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/cedent c s1)
          <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">this means vars in vs can occur in c</span>
          [(3c s2)
           (list (list 3vs 3c leave?) s2)])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef202e4" class="outline-4">
<h4 id="orgef202e4"><span class="done test">test</span> </h4>
<div class="outline-text-4" id="text-orgef202e4">
<div class="org-src-container">

<pre class="src src-scheme">(test
 (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (pass2/arrow x '()))
   (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (pass1/arrow 0 x))
     '((natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
       (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural) natural)
       (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span>)
       (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)
       (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
                              (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)
                              (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)))
       ((<span style="color: #a6e22e;">:t</span> : type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
       ((<span style="color: #a6e22e;">:t</span> @ type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
       ((<span style="color: #a6e22e;">:t^2</span> : type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
       ((<span style="color: #a6e22e;">:t1</span> <span style="color: #a6e22e;">:t2^2</span> <span style="color: #a6e22e;">:t3^0</span> : j k) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
       ((<span style="color: #a6e22e;">:t^2</span> @ type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type))))
 '(((((form3/name natural) (form3/name natural)) ((form3/name natural))) ())
   ((((form3/name natural) (form3/name natural)) ((form3/arrow (((form3/name natural) (form3/name natural)) ((form3/name natural)))) (form3/name natural))) ())
   ((((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/name zero)) ((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)))) ((<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ()))))
   ((((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name succ)) ((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name recur) (form3/name succ))) ((<span style="color: #a6e22e;">:n</span> . #(<span style="color: #a6e22e;">:n</span> ())) (<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ()))))
   ((((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name succ)) ((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/lambda (((((form3/name natural) (form3/name natural)) ((form3/name natural))) ((<span style="color: #a6e22e;">:n</span> . #(<span style="color: #a6e22e;">:n</span> ())) (<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ())))) (((((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name succ)) ((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name recur) (form3/name succ))) ((<span style="color: #a6e22e;">:n</span> . #(<span style="color: #a6e22e;">:n</span> ())) (<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ())))) ((((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name succ)) ((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name recur) (form3/name succ))) ((<span style="color: #a6e22e;">:n</span> . #(<span style="color: #a6e22e;">:n</span> ())) (<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ()))))))))) ((<span style="color: #a6e22e;">:n</span> . #(<span style="color: #a6e22e;">:n</span> ())) (<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ()))))
   ((((form3/bind (((form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 1))) ((form3/name type)) leave)) (form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 0))) ((form3/name type))) ((<span style="color: #a6e22e;">:t</span> . #(<span style="color: #a6e22e;">:t</span> ()))))
   ((((form3/bind (((form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 1))) ((form3/name type)) not-leave)) (form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 0))) ((form3/name type))) ((<span style="color: #a6e22e;">:t</span> . #(<span style="color: #a6e22e;">:t</span> ()))))
   ((((form3/bind (((form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 2))) ((form3/name type)) leave)) (form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 0))) ((form3/name type))) ((<span style="color: #a6e22e;">:t</span> . #(<span style="color: #a6e22e;">:t</span> ()))))
   ((((form3/bind (((form3/var (#(<span style="color: #a6e22e;">:t1</span> ()) 1)) (form3/var (#(<span style="color: #a6e22e;">:t2</span> ()) 2)) (form3/var (#(<span style="color: #a6e22e;">:t3</span> ()) 0))) ((form3/name j) (form3/name k)) leave)) (form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 0))) ((form3/name type))) ((<span style="color: #a6e22e;">:t</span> . #(<span style="color: #a6e22e;">:t</span> ())) (<span style="color: #a6e22e;">:t3</span> . #(<span style="color: #a6e22e;">:t3</span> ())) (<span style="color: #a6e22e;">:t2</span> . #(<span style="color: #a6e22e;">:t2</span> ())) (<span style="color: #a6e22e;">:t1</span> . #(<span style="color: #a6e22e;">:t1</span> ()))))
   ((((form3/bind (((form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 2))) ((form3/name type)) not-leave)) (form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 0))) ((form3/name type))) ((<span style="color: #a6e22e;">:t</span> . #(<span style="color: #a6e22e;">:t</span> ()))))))
</pre>
</div>
</div>
</div>
</div>
