sequent1.org
***** pass3/get-arrow

      #+begin_src scheme
      (define (pass3/get-arrow a e)
        ;; form3/arrow, env -> arrow
        (match (pass3/arrow a e)
          [((('arrow arrow) . _) _ _)
           arrow]))
      #+end_src

***** pass3/arrow

      #+begin_src scheme
      (define (pass3/arrow a e)
        ;; form3/arrow, env -> env
        (match e
          [(ds bs ns)
           (match a
             [(ac sc)
              (match (pass3/cedent ac e)
                [((d1 . _) _ _)
                 (match (pass3/cedent sc e)
                   [((d2 . _) _ _)
                    (list (cons (list 'arrow (list d1 d2))
                                ds)
                          bs
                          ns)])])])]))
      #+end_src

***** pass3/cedent

      #+begin_src scheme
      (define (pass3/cedent c e)
        ;; (form3 ...), env -> env
        (match e
          [(ds bs ns)
           (match c
             [() e]
             [(h . r) (pass3/cedent r (pass3 h e))])]))
      #+end_src

***** pass3/lambda

      #+begin_src scheme
      (define (pass3/lambda l e)
        ;; form3/lambda, env -> env
        (match e
          [(ds bs ns)
           (match l
             [(a al)
              (list (cons (list 'lambda
                                (pass3/get-arrow a e)
                                (map (lambda (x)
                                       (pass3/get-arrow x e))
                                  al))
                          ds)
                    bs
                    ns)])]))
      #+end_src

***** pass3

      #+begin_src scheme
      (define (pass3 f e)
        ;; form3, env -> env
        (match f
          [('form3/var x) (pass3/var x e)]
          [('form3/name x) (pass3/name x e)]
          [('form3/arrow x) (pass3/arrow x e)]
          [('form3/lambda x) (pass3/lambda x e)]
          [('form3/bind x) (pass3/bind x e)]))
      #+end_src

***** pass3/var

      #+begin_src scheme
      (define (pass3/var v e)
        ;; form3/var, env -> env
        (match e
          [(ds bs ns)
           ;; actually there is no need to search bs
           ;; but anyway
           (list (cons (bs/deep bs (list 'var v)) ds)
                 bs
                 ns)]))
      #+end_src

***** id->[symbol|ls]

      #+begin_src scheme
      (define (id->symbol id)
        (vector-ref id 0))

      (define (id->ls id)
        (vector-ref id 1))
      #+end_src

***** ><><>< bs/[find|walk|deep]

      - infer level n can get level n+1

      - note how the types of these functions are different

      #+begin_src scheme
      (define (bs/find bs v)
        ;; bs, var -> data or #f
        (match v
          [(id level)
           (let* ([level (if (eq? level #f)
                           0
                           level)]
                  [found/commit (assq level (id->ls id))])
             (if found/commit
               (cdr found/commit)
               (let* ([found/ls (assq id bs)]
                      [found/bind
                       (if found/ls
                         (assq level (cdr found/ls))
                         #f)])
                 (if found/bind
                   (cdr found/bind)
                   #f))))]))

      (define (bs/walk bs d)
        ;; bs, data -> data
        (match d
          [('var v)
           (let ([found (bs/find bs v)])
             (if found
               (bs/walk bs found)
               d))]
          [(_ e) d]))

      (define (bs/deep bs d)
        ;; bs, data -> data
        (define (bs/deep-list bs dl)
          (map (lambda (x) (bs/deep bs x)) dl))
        (define (bs/deep-arrow bs a)
          (match a
            [(dl1 dl2)
             (list (bs/deep-list bs dl1)
                   (bs/deep-list bs dl2))]))
        (define (bs/deep-arrow-list bs al)
          (map (lambda (a) (bs/deep-arrow bs a)) al))
        (match (bs/walk bs d)
          [('var v) ('var v)]
          [('cons (name dl))
           (list 'cons
                 (list name (bs/deep-list bs dl)))]
          [('arrow a) (list 'arrow (bs/deep-arrow bs a))]
          [('lambda (a al))
           (list 'lambda
                 (list (bs/deep-arrow bs a)
                       (bs/deep-arrow-list bs al)))]
          [('trunk (a al dl))
           (list 'trunk
                 (list (bs/deep-arrow bs a)
                       (bs/deep-arrow-list bs al)
                       (bs/deep-list bs dl)))]
          [('proj (a al dl i))
           (list 'proj
                 (list (bs/deep-arrow bs a)
                       (bs/deep-arrow-list bs al)
                       (bs/deep-list bs dl)
                       i))]))
      #+end_src

