sequent1.html

<div id="outline-container-org428ac4c" class="outline-3">
<h3 id="org428ac4c">pass3</h3>
<div class="outline-text-3" id="text-org428ac4c">
</div><div id="outline-container-orgc4e93bb" class="outline-4">
<h4 id="orgc4e93bb">pass3/get-arrow</h4>
<div class="outline-text-4" id="text-orgc4e93bb">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3/get-arrow</span> a e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form3/arrow, env -&gt; arrow</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> (pass3/arrow a e)
    [((('arrow arrow) . _) _ _)
     arrow]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf277e98" class="outline-4">
<h4 id="orgf277e98">pass3/arrow</h4>
<div class="outline-text-4" id="text-orgf277e98">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3/arrow</span> a e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form3/arrow, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     (<span style="color: #f92672; font-weight: bold;">match</span> a
       [(ac sc)
        (<span style="color: #f92672; font-weight: bold;">match</span> (pass3/cedent ac e)
          [((d1 . _) _ _)
           (<span style="color: #f92672; font-weight: bold;">match</span> (pass3/cedent sc e)
             [((d2 . _) _ _)
              (list (cons (list 'arrow (list d1 d2))
                          ds)
                    bs
                    ns)])])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b216b" class="outline-4">
<h4 id="org9b216b">pass3/cedent</h4>
<div class="outline-text-4" id="text-org9b216b">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3/cedent</span> c e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(form3 ...), env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     (<span style="color: #f92672; font-weight: bold;">match</span> c
       [() e]
       [(h . r) (pass3/cedent r (pass3 h e))])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf6260d" class="outline-4">
<h4 id="orgcf6260d">pass3/lambda</h4>
<div class="outline-text-4" id="text-orgcf6260d">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3/lambda</span> l e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form3/lambda, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     (<span style="color: #f92672; font-weight: bold;">match</span> l
       [(a al)
        (list (cons (list 'lambda
                          (pass3/get-arrow a e)
                          (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x)
                                 (pass3/get-arrow x e))
                            al))
                    ds)
              bs
              ns)])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org29df1e" class="outline-4">
<h4 id="org29df1e">pass3</h4>
<div class="outline-text-4" id="text-org29df1e">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3</span> f e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form3, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> f
    [('form3/var x) (pass3/var x e)]
    [('form3/name x) (pass3/name x e)]
    [('form3/arrow x) (pass3/arrow x e)]
    [('form3/lambda x) (pass3/lambda x e)]
    [('form3/bind x) (pass3/bind x e)]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbaeddf" class="outline-4">
<h4 id="orgfbaeddf">pass3/var</h4>
<div class="outline-text-4" id="text-orgfbaeddf">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3/var</span> v e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form3/var, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">actually there is no need to search bs</span>
     <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">but anyway</span>
     (list (cons (bs/deep bs (list 'var v)) ds)
           bs
           ns)]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org58a0070" class="outline-4">
<h4 id="org58a0070">id-&gt;[symbol|ls]</h4>
<div class="outline-text-4" id="text-org58a0070">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">id-&gt;symbol</span> id)
  (vector-ref id 0))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">id-&gt;ls</span> id)
  (vector-ref id 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ca6700" class="outline-4">
<h4 id="org9ca6700"><span class="todo _gt__lt__gt__lt__gt__lt_">&gt;&lt;&gt;&lt;&gt;&lt;</span> bs/[find|walk|deep]</h4>
<div class="outline-text-4" id="text-org9ca6700">
<ul class="org-ul">
<li><p>infer level n can get level n+1</p></li>

<li><p>note how the types of these functions are different</p></li></ul>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">bs/find</span> bs v)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">bs, var -&gt; data or #f</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> v
    [(id level)
     (<span style="color: #f92672; font-weight: bold;">let*</span> ([level (<span style="color: #f92672; font-weight: bold;">if</span> (eq? level #f)
                     0
                     level)]
            [found/commit (assq level (id-&gt;ls id))])
       (<span style="color: #f92672; font-weight: bold;">if</span> found/commit
         (cdr found/commit)
         (<span style="color: #f92672; font-weight: bold;">let*</span> ([found/ls (assq id bs)]
                [found/bind
                 (<span style="color: #f92672; font-weight: bold;">if</span> found/ls
                   (assq level (cdr found/ls))
                   #f)])
           (<span style="color: #f92672; font-weight: bold;">if</span> found/bind
             (cdr found/bind)
             #f))))]))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">bs/walk</span> bs d)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">bs, data -&gt; data</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> d
    [('var v)
     (<span style="color: #f92672; font-weight: bold;">let</span> ([found (bs/find bs v)])
       (<span style="color: #f92672; font-weight: bold;">if</span> found
         (bs/walk bs found)
         d))]
    [(_ e) d]))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">bs/deep</span> bs d)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">bs, data -&gt; data</span>
  (<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">bs/deep-list</span> bs dl)
    (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (bs/deep bs x)) dl))
  (<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">bs/deep-arrow</span> bs a)
    (<span style="color: #f92672; font-weight: bold;">match</span> a
      [(dl1 dl2)
       (list (bs/deep-list bs dl1)
             (bs/deep-list bs dl2))]))
  (<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">bs/deep-arrow-list</span> bs al)
    (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (a) (bs/deep-arrow bs a)) al))
  (<span style="color: #f92672; font-weight: bold;">match</span> (bs/walk bs d)
    [('var v) ('var v)]
    [('cons (name dl))
     (list 'cons
           (list name (bs/deep-list bs dl)))]
    [('arrow a) (list 'arrow (bs/deep-arrow bs a))]
    [('lambda (a al))
     (list 'lambda
           (list (bs/deep-arrow bs a)
                 (bs/deep-arrow-list bs al)))]
    [('trunk (a al dl))
     (list 'trunk
           (list (bs/deep-arrow bs a)
                 (bs/deep-arrow-list bs al)
                 (bs/deep-list bs dl)))]
    [('proj (a al dl i))
     (list 'proj
           (list (bs/deep-arrow bs a)
                 (bs/deep-arrow-list bs al)
                 (bs/deep-list bs dl)
                 i))]))
</pre>
</div>
</div>
</div>
