sequent1.org
***** pass3/name

      - this can be optimized by
        to do more computations before storing things into ns
        but I leave it for now

      #+begin_src scheme
      (define (pass3/name n e)
        ;; form3/name, env -> env
        (match e
          [(ds bs ns)
           (let ([found (assq n ns)])
             (if (not found)
               (orz ("pass3/name unknow name : ~a~%" n))
               (let ([meaning (cdr found)])
                 (match meaning
                   [('cons/type ((ac sc) name _))
                    (pass3/name/cons (length ac) name e)]
                   [('cons/data ((ac sc) name _))
                    (pass3/name/cons (length ac) name e)]
                   [('lambda ((ac sc) al))
                    (if (eq? 1 (length sc))
                      (pass3/name/trunk (length ac) l e)
                      (pass3/name/proj (length ac) (length sc) l e))]))))]))
      #+end_src

***** pass3/name/cons

      #+begin_src scheme
      (define (pass3/name/cons len name e)
        ;; length, name, env -> env
        (match e
          [(ds bs ns)
           (list (cons (list 'cons
                             (list name (sublist ds 0 len)))
                       (sublist ds len -1))
                 bs
                 ns)]))
      #+end_src

***** pass3/name/trunk

      #+begin_src scheme
      (define (pass3/name/trunk len l e)
        ;; length, lambda, env -> env
        (match e
          [(ds bs ns)
           (match l
             [(a al)
              (let ([a (copy-arrow a)]
                    [al (map copy-arrow al)]
                    [dl (sublist ds 0 len)])
                (list (cons (list 'trunk (list a al dl))
                            (sublist ds len -1))
                      bs
                      ns))])]))
      #+end_src

***** pass3/name/proj

      #+begin_src scheme
      (define (pass3/name/proj len slen l e)
        ;; length, length, lambda, env -> env
        (match e
          [(ds bs ns)
           (match l
             [(a al)
              (let* ([a (copy-arrow a)]
                     [al (map copy-arrow al)]
                     [dl (sublist ds 0 len)]
                     [make-proj (lambda (i) (list 'proj (list a al dl i)))])
                (list (append (map make-proj (genlist slen))
                              (sublist ds len -1))
                      bs
                      ns))])]))
      #+end_src

***** pass3/bind

      #+begin_src scheme
      (define (pass3/bind b e)
        ;; form3/bind, env -> env
        (match b
          [(vl c leave?)
           (match (pass3/cedent c e)
             [((d1 . _) _ _) ;; here I assume the c of bind is simple
              (letrec ([recur
                        (lambda (vl e)
                          (match (list vl e)
                            [(() _) e]
                            [(((id level) . r) (ds bs ns))
                             ;; ><><><
                             ;; need to check if the bind already exist
                             (id/commit! id (list (cons level d1)))
                             (recur r (list (if leave?
                                              (cons d1 ds)
                                              ds)
                                            bs
                                            ns))]))])
                (recur vl e))])]))
      #+end_src

***** id/commit!

      #+begin_src scheme
      (define (id/commit! id ls)
        ;; id, ls -> id
        ;; effect on id
        (let ()
          (vector-set! id (append ls (vector-ref id 1)))
          id))
      #+end_src

* copy-arrow

*** note copy

    - when forming trunk from lambda which is fetched from ns
      we have to copy the lambda

    - copy is arrow by arrow
      every var in new arrow is different from old arrow
      thus
      1. scope is also arrow by arrow
      2. a non-determinate var can not be substituted into lambda as it is
         but is copied

    - this copy is one of the main place where this prototype can be optimized
      a vm can be designed to replace this copy function
      and change the interpreter to a compiler

*** copy-arrow

    #+begin_src scheme
    (define (copy-arrow a)
      ;; arrow -> arrow
      (match (copy/arrow a '())
        [(a s) a]))
    #+end_src

*** copy/arrow

    #+begin_src scheme
    (define (copy/arrow a s)
      ;; arrow, scope -> (arrow scope)
      (match a
        [(ac sc)
         (match (copy/cedent ac s)
           [(ac1 s1)
            (match (copy/cedent sc s1)
              [(sc1 s2)
               (list ac1 sc1 s2)])])]))
    #+end_src

*** copy/cedent

    #+begin_src scheme
    (define (copy/cedent c s)
      ;; (data ...), scope -> ((data ...) scope)
      (match c
        [() (list '() s)]
        [(h . r)
         (match (copy h s)
           [(h1 s1)
            (match (copy/cedent r s1)
              [(r1 s2)
               (list (cons h1 r1) s2)])])]))
    #+end_src

