sequent1.html

<div id="outline-container-org2323c4a" class="outline-4">
<h4 id="org2323c4a">pass3/name</h4>
<div class="outline-text-4" id="text-org2323c4a">
<ul class="org-ul">
<li><p>this can be optimized by</p><p>to do more computations before storing things into ns</p><p>but I leave it for now</p></li></ul>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3/name</span> n e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form3/name, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     (<span style="color: #f92672; font-weight: bold;">let</span> ([found (assq n ns)])
       (<span style="color: #f92672; font-weight: bold;">if</span> (not found)
         (<span style="color: #f92672; font-weight: bold;">orz</span> (<span style="color: #e6db74;">"pass3/name unknow name : ~a~%"</span> n))
         (<span style="color: #f92672; font-weight: bold;">let</span> ([meaning (cdr found)])
           (<span style="color: #f92672; font-weight: bold;">match</span> meaning
             [('cons/type ((ac sc) name _))
              (pass3/name/cons (length ac) name e)]
             [('cons/data ((ac sc) name _))
              (pass3/name/cons (length ac) name e)]
             [('lambda ((ac sc) al))
              (<span style="color: #f92672; font-weight: bold;">if</span> (eq? 1 (length sc))
                (pass3/name/trunk (length ac) l e)
                (pass3/name/proj (length ac) (length sc) l e))]))))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org32bfa71" class="outline-4">
<h4 id="org32bfa71">pass3/name/cons</h4>
<div class="outline-text-4" id="text-org32bfa71">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3/name/cons</span> len name e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">length, name, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     (list (cons (list 'cons
                       (list name (sublist ds 0 len)))
                 (sublist ds len -1))
           bs
           ns)]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org497bdad" class="outline-4">
<h4 id="org497bdad">pass3/name/trunk</h4>
<div class="outline-text-4" id="text-org497bdad">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3/name/trunk</span> len l e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">length, lambda, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     (<span style="color: #f92672; font-weight: bold;">match</span> l
       [(a al)
        (<span style="color: #f92672; font-weight: bold;">let</span> ([a (copy-arrow a)]
              [al (<span style="color: #f92672; font-weight: bold;">map</span> copy-arrow al)]
              [dl (sublist ds 0 len)])
          (list (cons (list 'trunk (list a al dl))
                      (sublist ds len -1))
                bs
                ns))])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga71507" class="outline-4">
<h4 id="orga71507">pass3/name/proj</h4>
<div class="outline-text-4" id="text-orga71507">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3/name/proj</span> len slen l e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">length, length, lambda, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     (<span style="color: #f92672; font-weight: bold;">match</span> l
       [(a al)
        (<span style="color: #f92672; font-weight: bold;">let*</span> ([a (copy-arrow a)]
               [al (<span style="color: #f92672; font-weight: bold;">map</span> copy-arrow al)]
               [dl (sublist ds 0 len)]
               [make-proj (<span style="color: #f92672; font-weight: bold;">lambda</span> (i) (list 'proj (list a al dl i)))])
          (list (append (<span style="color: #f92672; font-weight: bold;">map</span> make-proj (genlist slen))
                        (sublist ds len -1))
                bs
                ns))])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa8a51d" class="outline-4">
<h4 id="orgaa8a51d">pass3/bind</h4>
<div class="outline-text-4" id="text-orgaa8a51d">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass3/bind</span> b e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form3/bind, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> b
    [(vl c leave?)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass3/cedent c e)
       [((d1 . _) _ _) <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">here I assume the c of bind is simple</span>
        (<span style="color: #f92672; font-weight: bold;">letrec</span> ([recur
                  (<span style="color: #f92672; font-weight: bold;">lambda</span> (vl e)
                    (<span style="color: #f92672; font-weight: bold;">match</span> (list vl e)
                      [(() _) e]
                      [(((id level) . r) (ds bs ns))
                       <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">&gt;&lt;&gt;&lt;&gt;&lt;</span>
                       <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">need to check if the bind already exist</span>
                       (id/commit! id (list (cons level d1)))
                       (recur r (list (<span style="color: #f92672; font-weight: bold;">if</span> leave?
                                        (cons d1 ds)
                                        ds)
                                      bs
                                      ns))]))])
          (recur vl e))])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org666c374" class="outline-4">
<h4 id="org666c374">id/commit!</h4>
<div class="outline-text-4" id="text-org666c374">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">id/commit!</span> id ls)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">id, ls -&gt; id</span>
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">effect on id</span>
  (<span style="color: #f92672; font-weight: bold;">let</span> ()
    (<span style="color: #f92672; font-weight: bold;">vector-set!</span> id (append ls (vector-ref id 1)))
    id))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orga8ccf91" class="outline-2">
<h2 id="orga8ccf91">copy-arrow</h2>
<div class="outline-text-2" id="text-orga8ccf91">
</div><div id="outline-container-org1a7f60b" class="outline-3">
<h3 id="org1a7f60b"><span class="todo note">note</span> copy</h3>
<div class="outline-text-3" id="text-org1a7f60b">
<ul class="org-ul">
<li><p>when forming trunk from lambda which is fetched from ns</p><p>we have to copy the lambda</p></li>

<li><p>copy is arrow by arrow</p><p>every var in new arrow is different from old arrow</p><p>thus</p><p><ol class="org-ol"></p><p><li>scope is also arrow by arrow</li></p><p><li>a non-determinate var can not be substituted into lambda as it is</p><p>but is copied</li></ol></p></li>

<li><p>this copy is one of the main place where this prototype can be optimized</p><p>a vm can be designed to replace this copy function</p><p>and change the interpreter to a compiler</p></li></ul>
</div>
</div>

<div id="outline-container-org899a3b0" class="outline-3">
<h3 id="org899a3b0">copy-arrow</h3>
<div class="outline-text-3" id="text-org899a3b0">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy-arrow</span> a)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">arrow -&gt; arrow</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> (copy/arrow a '())
    [(a s) a]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org98ca98e" class="outline-3">
<h3 id="org98ca98e">copy/arrow</h3>
<div class="outline-text-3" id="text-org98ca98e">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy/arrow</span> a s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">arrow, scope -&gt; (arrow scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> a
    [(ac sc)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/cedent ac s)
       [(ac1 s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (copy/cedent sc s1)
          [(sc1 s2)
           (list ac1 sc1 s2)])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga495979" class="outline-3">
<h3 id="orga495979">copy/cedent</h3>
<div class="outline-text-3" id="text-orga495979">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy/cedent</span> c s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(data ...), scope -&gt; ((data ...) scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> c
    [() (list '() s)]
    [(h . r)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy h s)
       [(h1 s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (copy/cedent r s1)
          [(r1 s2)
           (list (cons h1 r1) s2)])])]))
</pre>
</div>
</div>
</div>
