sequent1.org
*** copy/lambda

    #+begin_src scheme
    (define (copy/lambda l s)
      ;; lambda, scope -> (lambda scope)
      (match l
        [(a al)
         (match (copy/arrow a s)
           [(a1 s1)
            (match (copy/arrow-list al s1)
              [(al1 s2)
               (list (list a1 al1) s2)])])]))
    #+end_src

*** copy/arrow-list

    #+begin_src scheme
    (define (copy/arrow-list al s)
      ;; (arrow ...), scope -> ((arrow ...) scope)
      (match al
        [() (list '() s)]
        [(h . r)
         (match (copy/arrow h s)
           [(h1 s1)
            (match (copy/arrow-list r s1)
              [(r1 s2)
               (list (cons h1 r1) s2)])])]))
    #+end_src

*** copy

    #+begin_src scheme
    (define (copy d s)
      ;; data, scope -> (data scope)
      (match d
        [('var x)
         (match (copy/var x s)
           [(x1 s1)
            (list (list 'var x1) s1)])]
        [('cons x)
         (match (copy/cons x s)
           [(x1 s1)
            (list (list 'cons x1) s1)])]
        [('arrow x)
         (match (copy/arrow x s)
           [(x1 s1)
            (list (list 'arrow x1) s1)])]
        [('lambda x)
         (match (copy/lambda x s)
           [(x1 s1)
            (list (list 'lambda x1) s1)])]
        [('trunk x)
         (match (copy/trunk x s)
           [(x1 s1)
            (list (list 'trunk x1) s1)])]
        [('proj x)
         (match (copy/proj x s)
           [(x1 s1)
            (list (list 'proj x1) s1)])]))
    #+end_src

*** copy/var

    #+begin_src scheme
    (define (copy/var v s)
      ;; var, scope -> (var scope)
      (match v
        [(id level)
         (let ([found (assq id scope)])
           (if found
             (list (list (cdr found) level) s)
             (let* ([ls (id->ls id)]
                    [id1 (vector (id->symbol id) '())]
                    [s1 (cons (cons id id1) s)])
               (match (copy/ls ls s1)
                 [(ls1 s2)
                  (id/commit! id1 ls1)
                  (list (list id1 level) s2)]))))]))
    #+end_src

*** copy/ls

    #+begin_src scheme
    (define (copy/ls ls s)
      ;; ls, scope -> (ls scope)
      (match ls
        [() (list '() s)]
        [((level . data) . r)
         (match (copy data s)
           [(data1 s1)
            (match (copy/ls r s1)
              [(r1 s2)
               (list (cons (cons level data1)
                           r1)
                     s2)])])]))
    #+end_src

*** copy/cons

    #+begin_src scheme
    (define (copy/cons c s)
      ;; cons, scope -> (cons scope)
      (match c
        [(n dl)
         (match (copy/cedent dl s)
           [(dl1 s1)
            (list (list n dl1) s1)])]))
    #+end_src

*** copy/trunk

    #+begin_src scheme
    (define (copy/trunk t s)
      ;; trunk, scope -> (trunk scope)
      (match t
        [(a al dl)
         (match (copy/arrow a s)
           [(a1 s1)
            (match (copy/arrow-list al s1)
              [(al1 s2)
               (match (copy/cedent dl s2)
                 [(dl1 s3)
                  (list (list a1 al1 dl1) s3)])])])]))
    #+end_src

*** copy/proj

    #+begin_src scheme
    (define (copy/proj p s)
      ;; proj, scope -> (proj scope)
      (match p
        [(a al dl i)
         (match (copy/arrow a s)
           [(a1 s1)
            (match (copy/arrow-list al s1)
              [(al1 s2)
               (match (copy/cedent dl s2)
                 [(dl1 s3)
                  (list (list a1 al1 dl1 i) s3)])])])]))
    #+end_src

* compute-arrow

*** compute-arrow

    - compute is actually done by unification

    #+begin_src scheme
    (define (compute-arrow a e)
      ;; arrow, env -> report
      (match e
        [(ds bs ns)
         (match a
           [(ac sc)
            (match (unify (lambda (e) (compute/cedent ac e))
                          (list ds
                                (cons '(commit-point) bs)
                                ns))
              [('fail info-list)
               (list 'fail
                     (cons `(compute-arrow fail (arrow ,a)) info-list))]
              [('success e1)
               (match (compute/cedent sc e1)
                 [(ds2 bs2 ns2)
                  (list 'success
                        (list ds2 (bs/commit! bs2) ns2))])])])]))
    #+end_src

*** bs/commit!

    #+begin_src scheme
    (define (bs/commit! bs)
      ;; bs -> bs
      ;; effect on part of bs
      (cond [(equal? '(commit-point) (car bs))
             (cdr bs)]
            [else
             (let* ([pair (car bs)]
                    [id (car pair)]
                    [ls (cdr pair)])
               (id/commit! id ls)
               (bs/commit! (cdr bs)))]))
    #+end_src

*** compute/cedent

    #+begin_src scheme
    (define (compute/cedent c e)
      ;; cedent, env -> env
      (match c
        [() e]
        [(h . r) (compute/cedent r (compute h e))]))
    #+end_src

