sequent1.html

<div id="outline-container-orgb275f1d" class="outline-3">
<h3 id="orgb275f1d">copy/lambda</h3>
<div class="outline-text-3" id="text-orgb275f1d">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy/lambda</span> l s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">lambda, scope -&gt; (lambda scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> l
    [(a al)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/arrow a s)
       [(a1 s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (copy/arrow-list al s1)
          [(al1 s2)
           (list (list a1 al1) s2)])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2473edf" class="outline-3">
<h3 id="org2473edf">copy/arrow-list</h3>
<div class="outline-text-3" id="text-org2473edf">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy/arrow-list</span> al s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(arrow ...), scope -&gt; ((arrow ...) scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> al
    [() (list '() s)]
    [(h . r)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/arrow h s)
       [(h1 s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (copy/arrow-list r s1)
          [(r1 s2)
           (list (cons h1 r1) s2)])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf906b8" class="outline-3">
<h3 id="orgdf906b8">copy</h3>
<div class="outline-text-3" id="text-orgdf906b8">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy</span> d s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">data, scope -&gt; (data scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> d
    [('var x)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/var x s)
       [(x1 s1)
        (list (list 'var x1) s1)])]
    [('cons x)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/cons x s)
       [(x1 s1)
        (list (list 'cons x1) s1)])]
    [('arrow x)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/arrow x s)
       [(x1 s1)
        (list (list 'arrow x1) s1)])]
    [('lambda x)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/lambda x s)
       [(x1 s1)
        (list (list 'lambda x1) s1)])]
    [('trunk x)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/trunk x s)
       [(x1 s1)
        (list (list 'trunk x1) s1)])]
    [('proj x)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/proj x s)
       [(x1 s1)
        (list (list 'proj x1) s1)])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga5c6b24" class="outline-3">
<h3 id="orga5c6b24">copy/var</h3>
<div class="outline-text-3" id="text-orga5c6b24">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy/var</span> v s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">var, scope -&gt; (var scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> v
    [(id level)
     (<span style="color: #f92672; font-weight: bold;">let</span> ([found (assq id scope)])
       (<span style="color: #f92672; font-weight: bold;">if</span> found
         (list (list (cdr found) level) s)
         (<span style="color: #f92672; font-weight: bold;">let*</span> ([ls (id-&gt;ls id)]
                [id1 (vector (id-&gt;symbol id) '())]
                [s1 (cons (cons id id1) s)])
           (<span style="color: #f92672; font-weight: bold;">match</span> (copy/ls ls s1)
             [(ls1 s2)
              (id/commit! id1 ls1)
              (list (list id1 level) s2)]))))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org753ed69" class="outline-3">
<h3 id="org753ed69">copy/ls</h3>
<div class="outline-text-3" id="text-org753ed69">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy/ls</span> ls s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">ls, scope -&gt; (ls scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> ls
    [() (list '() s)]
    [((level . data) . r)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy data s)
       [(data1 s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (copy/ls r s1)
          [(r1 s2)
           (list (cons (cons level data1)
                       r1)
                 s2)])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org27d791c" class="outline-3">
<h3 id="org27d791c">copy/cons</h3>
<div class="outline-text-3" id="text-org27d791c">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy/cons</span> c s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">cons, scope -&gt; (cons scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> c
    [(n dl)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/cedent dl s)
       [(dl1 s1)
        (list (list n dl1) s1)])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org426a0ce" class="outline-3">
<h3 id="org426a0ce">copy/trunk</h3>
<div class="outline-text-3" id="text-org426a0ce">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy/trunk</span> t s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">trunk, scope -&gt; (trunk scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> t
    [(a al dl)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/arrow a s)
       [(a1 s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (copy/arrow-list al s1)
          [(al1 s2)
           (<span style="color: #f92672; font-weight: bold;">match</span> (copy/cedent dl s2)
             [(dl1 s3)
              (list (list a1 al1 dl1) s3)])])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c12b16" class="outline-3">
<h3 id="org1c12b16">copy/proj</h3>
<div class="outline-text-3" id="text-org1c12b16">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">copy/proj</span> p s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">proj, scope -&gt; (proj scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> p
    [(a al dl i)
     (<span style="color: #f92672; font-weight: bold;">match</span> (copy/arrow a s)
       [(a1 s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (copy/arrow-list al s1)
          [(al1 s2)
           (<span style="color: #f92672; font-weight: bold;">match</span> (copy/cedent dl s2)
             [(dl1 s3)
              (list (list a1 al1 dl1 i) s3)])])])]))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org461d9cd" class="outline-2">
<h2 id="org461d9cd">compute-arrow</h2>
<div class="outline-text-2" id="text-org461d9cd">
</div><div id="outline-container-orgf9d28b9" class="outline-3">
<h3 id="orgf9d28b9">compute-arrow</h3>
<div class="outline-text-3" id="text-orgf9d28b9">
<ul class="org-ul">
<li><p>compute is actually done by unification</p></li></ul>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">compute-arrow</span> a e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">arrow, env -&gt; report</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     (<span style="color: #f92672; font-weight: bold;">match</span> a
       [(ac sc)
        (<span style="color: #f92672; font-weight: bold;">match</span> (unify (<span style="color: #f92672; font-weight: bold;">lambda</span> (e) (compute/cedent ac e))
                      (list ds
                            (cons '(commit-point) bs)
                            ns))
          [('fail info-list)
           (list 'fail
                 (cons `(compute-arrow fail (arrow ,a)) info-list))]
          [('success e1)
           (<span style="color: #f92672; font-weight: bold;">match</span> (compute/cedent sc e1)
             [(ds2 bs2 ns2)
              (list 'success
                    (list ds2 (bs/commit! bs2) ns2))])])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge829e12" class="outline-3">
<h3 id="orge829e12">bs/commit!</h3>
<div class="outline-text-3" id="text-orge829e12">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">bs/commit!</span> bs)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">bs -&gt; bs</span>
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">effect on part of bs</span>
  (<span style="color: #f92672; font-weight: bold;">cond</span> [(equal? '(commit-point) (car bs))
         (cdr bs)]
        [else
         (<span style="color: #f92672; font-weight: bold;">let*</span> ([pair (car bs)]
                [id (car pair)]
                [ls (cdr pair)])
           (id/commit! id ls)
           (bs/commit! (cdr bs)))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf00343" class="outline-3">
<h3 id="orgbf00343">compute/cedent</h3>
<div class="outline-text-3" id="text-orgbf00343">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">compute/cedent</span> c e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">cedent, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> c
    [() e]
    [(h . r) (compute/cedent r (compute h e))]))
</pre>
</div>
</div>
</div>
