sequent1.org
*** compute

    #+begin_src scheme
    (define (compute f e)
      ;; data, env -> env
      (match e
        [(ds bs ns)
         (list (cons f ds) bs ns)]))

    ;; (define (compute f e)
    ;;   ;; data, env -> env
    ;;   (match e
    ;;     [(ds bs ns)
    ;;      (match f
    ;;        [('var x) (list (cons (bs/deep bs f) ds) bs ns)]
    ;;        [('cons x) (list (cons f ds) bs ns)]
    ;;        [('arrow x) (list (cons f ds) bs ns)]
    ;;        [('lambda x) (list (cons f ds) bs ns)]
    ;;        [('trunk x) (list (cons f ds) bs ns)]
    ;;        [('proj x) (list (cons f ds) bs ns)])]))
    #+end_src

* >< unify

*** >< unify

    #+begin_src scheme
    (define (unify e)
      ;; (env -> env), env -> unify-report
      )
    #+end_src

*** >< bs/extend

    #+begin_src scheme
    (defun bs/extend (default-level bs v d)
      ;; bs var data -> bs
      (match v
        (id level) =>
        (let* ((level (if (eq nil level)
                          default-level
                          level))
               (found/ls (assoc id bs :test #'eq)))
          (if found/ls
              (substitute (cons id (cons (cons level d)
                                         (cdr found/ls)))
                          (lambda (pair) (eq (car pair) id))
                          bs)
              (cons (cons id (list (cons level d)))
                    bs)))))
    #+end_src

* >< eva

* >< check

* >< type-compute

* >< sequent

* test

*** natural

    #+begin_src scheme :tangle no
    (sequent

      (dt type (-> type))

      (dt natural (-> type)
          zero (-> natural)
          succ (natural -> natural))

      (df add (natural natural -> natural)
          (:m zero -> :m)
          (:m :n succ -> :m :n add succ))

      (df mul (natural natural -> natural)
          (:m zero -> zero)
          (:m :n succ -> :m :n mul :m add))

      (ap (->
           zero succ
           zero succ succ
           add))

      (ap (->
           zero succ succ
           zero succ succ
           mul))

      (ap (-> mul)))
    #+end_src

*** list

    #+begin_src scheme :tangle no
    (sequent

      (dt type (-> type))

      (dt natural (-> type)
          zero (-> natural)
          succ (natural -> natural))

      (df add (natural natural -> natural)
          (:m zero -> :m)
          (:m :n succ -> :m :n add succ))

      (df mul (natural natural -> natural)
          (:m zero -> zero)
          (:m :n succ -> :m :n mul :m add))

      (dt list ((:t : type) :t -> type)
          null (-> :t list)
          cons (:t list :t -> :t list))

      ;; (df map (:t1 list (:t1 -> :t2) -> :t2 list)
      ;;     (null :f -> null)
      ;;     (:l :e cons :f -> :e :f apply :l :f map cons))

      (df append (:t list :t list -> :t1 list)
          (:l null -> :l)
          (:l :r :e cons -> :l :r append :e cons))

      (ap (->
           null
           zero cons
           zero cons
           zero cons
           null
           zero cons
           zero cons
           zero cons
           append)))
    #+end_src

