sequent1.html

<div id="outline-container-orgb3834be" class="outline-3">
<h3 id="orgb3834be">compute</h3>
<div class="outline-text-3" id="text-orgb3834be">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">compute</span> f e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">data, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     (list (cons f ds) bs ns)]))

<span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(define (compute f e)</span>
<span style="color: #FF8888;">;;   </span><span style="color: #FF8888;">;; data, env -&gt; env</span>
<span style="color: #FF8888;">;;   </span><span style="color: #FF8888;">(match e</span>
<span style="color: #FF8888;">;;     </span><span style="color: #FF8888;">[(ds bs ns)</span>
<span style="color: #FF8888;">;;      </span><span style="color: #FF8888;">(match f</span>
<span style="color: #FF8888;">;;        </span><span style="color: #FF8888;">[('var x) (list (cons (bs/deep bs f) ds) bs ns)]</span>
<span style="color: #FF8888;">;;        </span><span style="color: #FF8888;">[('cons x) (list (cons f ds) bs ns)]</span>
<span style="color: #FF8888;">;;        </span><span style="color: #FF8888;">[('arrow x) (list (cons f ds) bs ns)]</span>
<span style="color: #FF8888;">;;        </span><span style="color: #FF8888;">[('lambda x) (list (cons f ds) bs ns)]</span>
<span style="color: #FF8888;">;;        </span><span style="color: #FF8888;">[('trunk x) (list (cons f ds) bs ns)]</span>
<span style="color: #FF8888;">;;        </span><span style="color: #FF8888;">[('proj x) (list (cons f ds) bs ns)])]))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdebb49f" class="outline-2">
<h2 id="orgdebb49f"><span class="todo _gt__lt_">&gt;&lt;</span> unify</h2>
<div class="outline-text-2" id="text-orgdebb49f">
</div><div id="outline-container-orga4d623b" class="outline-3">
<h3 id="orga4d623b"><span class="todo _gt__lt_">&gt;&lt;</span> unify</h3>
<div class="outline-text-3" id="text-orga4d623b">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">unify</span> e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(env -&gt; env), env -&gt; unify-report</span>
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-org809f8bd" class="outline-3">
<h3 id="org809f8bd"><span class="todo _gt__lt_">&gt;&lt;</span> bs/extend</h3>
<div class="outline-text-3" id="text-org809f8bd">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">defun</span> bs/extend (default-level bs v d)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">bs var data -&gt; bs</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> v
    (id level) =&gt;
    (<span style="color: #f92672; font-weight: bold;">let*</span> ((level (<span style="color: #f92672; font-weight: bold;">if</span> (eq nil level)
                      default-level
                      level))
           (found/ls (assoc id bs <span style="color: #a6e22e;">:test</span> #'eq)))
      (<span style="color: #f92672; font-weight: bold;">if</span> found/ls
          (substitute (cons id (cons (cons level d)
                                     (cdr found/ls)))
                      (<span style="color: #f92672; font-weight: bold;">lambda</span> (pair) (eq (car pair) id))
                      bs)
          (cons (cons id (list (cons level d)))
                bs)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd109c17" class="outline-2">
<h2 id="orgd109c17"><span class="todo _gt__lt_">&gt;&lt;</span> eva</h2>
</div>

<div id="outline-container-org54de80e" class="outline-2">
<h2 id="org54de80e"><span class="todo _gt__lt_">&gt;&lt;</span> check</h2>
</div>

<div id="outline-container-orge87fc27" class="outline-2">
<h2 id="orge87fc27"><span class="todo _gt__lt_">&gt;&lt;</span> type-compute</h2>
</div>

<div id="outline-container-org487fcea" class="outline-2">
<h2 id="org487fcea"><span class="todo _gt__lt_">&gt;&lt;</span> sequent</h2>
</div>

<div id="outline-container-orge94bf23" class="outline-2">
<h2 id="orge94bf23"><span class="done test">test</span> </h2>
<div class="outline-text-2" id="text-orge94bf23">
</div><div id="outline-container-org1e9f619" class="outline-3">
<h3 id="org1e9f619">natural</h3>
<div class="outline-text-3" id="text-org1e9f619">
<div class="org-src-container">

<pre class="src src-scheme">(sequent

  (dt type (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type))

  (dt natural (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
      zero (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      succ (natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural))

  (df add (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span>)
      (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add succ))

  (df mul (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> zero)
      (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> mul <span style="color: #a6e22e;">:m</span> add))

  (ap (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
       zero succ
       zero succ succ
       add))

  (ap (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
       zero succ succ
       zero succ succ
       mul))

  (ap (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> mul)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge94192b" class="outline-3">
<h3 id="orge94192b">list</h3>
<div class="outline-text-3" id="text-orge94192b">
<div class="org-src-container">

<pre class="src src-scheme">(sequent

  (dt type (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type))

  (dt natural (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
      zero (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      succ (natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural))

  (df add (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span>)
      (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add succ))

  (df mul (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> zero)
      (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> mul <span style="color: #a6e22e;">:m</span> add))

  (dt list ((<span style="color: #a6e22e;">:t</span> : type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
      null (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:t</span> list)
      cons (<span style="color: #a6e22e;">:t</span> list <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:t</span> list))

  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(df map (:t1 list (:t1 -&gt; :t2) -&gt; :t2 list)</span>
  <span style="color: #FF8888;">;;     </span><span style="color: #FF8888;">(null :f -&gt; null)</span>
  <span style="color: #FF8888;">;;     </span><span style="color: #FF8888;">(:l :e cons :f -&gt; :e :f apply :l :f map cons))</span>

  (df append (<span style="color: #a6e22e;">:t</span> list <span style="color: #a6e22e;">:t</span> list <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:t1</span> list)
      (<span style="color: #a6e22e;">:l</span> null <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:l</span>)
      (<span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:r</span> <span style="color: #a6e22e;">:e</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:r</span> append <span style="color: #a6e22e;">:e</span> cons))

  (ap (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
       null
       zero cons
       zero cons
       zero cons
       null
       zero cons
       zero cons
       zero cons
       append)))
</pre>
</div>
</div>
</div>
