sequent1.html

<div id="outline-container-org261d930" class="outline-3">
<h3 id="org261d930">vector</h3>
<div class="outline-text-3" id="text-org261d930">
<div class="org-src-container">

<pre class="src src-scheme">(sequent

  (dt type (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type))

  (dt natural (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
      zero (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      succ (natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural))

  (df add (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span>)
      (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add succ))

  (df mul (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> zero)
      (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> mul <span style="color: #a6e22e;">:m</span> add))

  (dt vector ((<span style="color: #a6e22e;">:t</span> : type) natural <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
      null (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> zero <span style="color: #a6e22e;">:t</span> vector)
      cons (<span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:t</span> vector <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #a6e22e;">:t</span> vector))

  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(df map (:n :t1 vector (:t1 -&gt; :t2) -&gt; :n :t2 vector)</span>
  <span style="color: #FF8888;">;;     </span><span style="color: #FF8888;">(null :f -&gt; null)</span>
  <span style="color: #FF8888;">;;     </span><span style="color: #FF8888;">(:l :e cons :f -&gt; :e :f apply :l :f map cons))</span>

  (df append (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:t</span> vector <span style="color: #a6e22e;">:n</span> <span style="color: #a6e22e;">:t</span> vector <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add <span style="color: #a6e22e;">:t</span> vector)
      (<span style="color: #a6e22e;">:l</span> null <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:l</span>)
      (<span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:r</span> <span style="color: #a6e22e;">:e</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:r</span> append <span style="color: #a6e22e;">:e</span> cons))

  (ap (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
       null
       zero cons
       zero cons
       zero cons
       null
       zero cons
       zero cons
       zero cons
       append)))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
喪以不執 所執者喪 執喪相比 方死方生
</div>
</body>
</html>
